base/InformationRegisters/бит_ИсторияРедактированияРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ИсторияРедактированияРеквизитов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/бит_ИсторияРедактированияРеквизитов/Forms/ФормаИсторииРедактирования/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстЗаголовка = НСтр("ru = 'История изменения реквизита ""%1"" для ""%2""'; 
						  |en = 'История изменения реквизита ""%1"" для ""%2""'");
	Заголовок = СтрШаблон(ТекстЗаголовка, ПредставлениеРеквизита, Объект);
		
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Объект"				   , Объект);
	Параметры.Свойство("ИмяРеквизита"		   , ИмяРеквизита);
	Параметры.Свойство("ПредставлениеРеквизита", ПредставлениеРеквизита);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РегистрСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.РегистрСписок.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено И ЭтотОбъект.ВладелецФормы <> Неопределено Тогда
		
		Если ТипЗнч(ЭтотОбъект.ВладелецФормы) = Тип("УправляемаяФорма") Тогда
		 	ОбъектВладелец 		= ЭтотОбъект.ВладелецФормы.Объект;
			ЕстьРеквизитОбъекта = ОбъектВладелец.Свойство(ИмяРеквизита);
		Иначе
			ОбъектВладелец 		= ЭтотОбъект.ВладелецФормы.СправочникОбъект;
			ЕстьРеквизитОбъекта = ОбъектВладелец.Метаданные().Реквизиты.Найти(ИмяРеквизита) <> Неопределено;
		КонецЕсли;
				
		Если ЕстьРеквизитОбъекта Тогда
			ОбъектВладелец[ИмяРеквизита] = ТекущиеДанные.ЗначениеРеквизита;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры // РегистрСписокВыбор()

#КонецОбласти
